// AutoProject.h : main header file for the AUTOPROJECT application
//

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.031>
//	<16.04. 2001  11:10>
//
//  <Логический модуль>: конвертация с использованием 
//	буфферной базы в аналоговой адресации 
//
//  <Проблема>:	При дабавлении нового столбца или строчки программа не находила 
//  существующие столбцы и сторочки.              
//	<Причина>:	[TransformLogCrd(...)] ;  step = m_ColMap.GetCount(); при
//   поиске нужной строчки или столбца в Excel таблице.
//   Считалось, что если столбец или строчка не сущ., то и все последующие 
//   строчки и столбцы не существуют, что является логической ошибкой
//   <Решение>:     
//            строчку:  step = m_ColMap.GetCount();  заменили на step = 0;
// 					 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.032>
//	<26.04. 2001  13:16>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема>:	балансовские счета (строчки типа "04-12") преобразуются к датам 
// 
//	<Причина>:	так работат в Excel стандартная функция SetFormula(...) 
//
//   <Решение>: функция converNumber при обнаружении строчки подобного
//						типа добавляет в конец символ "|"
// 					 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.033>
//	<4.05. 2001  17:21>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема>:	если строчка форматирования начинается с пробелов
//                         происходит перемешивание столбцов
//	<Причина>:	первые пробелы учитываются при разборе
//
//   <Решение>: функция converList определяет сдвиг таблицы; у всех
//						  строчек вырезает столько же первых сиволов 
// 					 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.034>
//	<10.05. 2001  10:00>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема>:	Если не указан лист, то программа валится
//	<Причина>:	Ошибка в программе - не правильная праверка количества 
//                         параметров передаваемых в командной строке .
//                         m_buff.GetSize() >= n ... далее шло m_buff[n] 
//
//   <Решение>: Исправил в нужных местах на m_buff.GetSize() > n
// 					 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.034>
//	<10.05. 2001 11:27>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема>:	Символ табуляции конвертируется неправильно в 1 пробел
//	<Причина>:	Не было договоренности как его интерпретировать
//
//   <Решение>: Интерпретация табуляции в файле конфигурации; 
//                        по умолчанию 4
// 					 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.035>
//	<16.05. 2001 9:58>
//
//  <Логический модуль>: конвертация с использованием 
//	буфферной базы в аналоговой адресации и прямой адресации
//
//  <Проблема>:	Символ ":" служит для определения логической адрессации
//                          и задания региона - это привело к тому, что задать регион
//                          стало не возможно.
//	<Причина>:	Забыл про эту особенность задания регионов 
//
//   <Решение>: В качестве символа разделителя в логической адрессации
//                        теперь используется "::"
// 					 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.036>
//	<16.05. 2001 15:02>
//
//  <Логический модуль>: конвертация с использованием 
//	буфферной базы в аналоговой адресации
//
//  <Проблема>:	Необходима возможность в логической адрессации добавить 
//                         возможность использовать числовые смещения от заданной ячейки.
//	<Причина>:	
//   <Решение>:  Добавлена необходимая функциональность.  При аналоговой адрессации
//                         в фигурных скобках указывается смещение. Смещение может быть
//                         как положительное, так и отрицательное. В том случае, если не указано
//                         название ряда или столбца смещение высчитывается от левого верхнего
//                         угла таблицы, описанного в поле Prim .
//	  <Пример>:  Col{+1}::Row{+20}
//                        Col{+5}::{+15}           
//                        {+4}::{-15}                           
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.037> 	<21.05. 2001 10:02>
//
//  <Логический модуль>: конвертация с использованием 
//	буфферной базы в аналоговой адресации
//
//  <Проблема>:	Низкая скорость поиска нужной ячейки
//
//	<Причина>:	Поиск строки и столбца начинается с начала таблицы
//   <Решение>:  Необходимо сначала инициализировать таблицу преобразований
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.037> 	<21.05. 2001 16:20>
//
//  <Логический модуль>: конвертация с использованием 
//	буфферной базы в аналоговой адресации
//
//  <Проблема>:	Необходим добавиь возможность скрывать, открывать строчки
//                         и столбцы.
//	<Причина>:	
//   <Решение>:  Добавленна необходимая функциональность. В поле Prim
//                          после ":" можно указать необходимую команду (Row(Col)Hide(Show))
//   <Пример:>   "A1 : RowHide"
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.038> 	<21.05. 2001 16:20>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема>:	Несовместимость с генератором отчетов, в частности как определять
//                         конец таблицы, не преобразует символ "={=".
//	<Причина>:	Отсутствие договоренности
//   <Решение>:  Обрабатывам  спец. сиволы, принятые в программе печати
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.039> 	<8.06. 2001 14:24>
//
//  <Логический модуль>: все модули
//
//  <Проблема>:	Если при работе конвертера закрывают Excel или вторая
//						   копия конвертера пытается писать в тот же Excel файл, то
//					       программа валится.
//	<Причина>:	
//   <Решение>:  Показать индикатор, что процесс конвертации еще не 
//						   завершен, обработать исключительные ситуации.	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.040> 	<8.06. 2001 14:24>
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема 1>:	Необходимо выделять итоговые строчки жирным шрифтом
//  <Проблема 2>:	Необходимо выгружать таблицу без шапки.
//
//	<Причина>:
//   <Решение>: <1> В файле конфигураций описать список замен, куда можно
//								 включить и тэги выделения.
//						  <2> В файле конфигурации оприсать специальное слово NOHEAD 
//	<Дополнения>:	
//							<1> Появилась возможность описать все параметры запуска в 
//								  в файле конфигуаций. Включены следующие cспец. слова:
//								<SOURCE:>, <EXCELNAME:>, <LISTNAME>,
//								<TEMPLATE>, <TEMPLATELIST>
//	<Пример:>
//		Название файла отчета или буффера 	
//		SOURCE:"C:\$\redbaln.txt"
//		Имя ехсеl файла, куда конвертируется отчет
//		EXCELNAME:"C:\Ex.xls"
//		Название листа
//		LISTNAME:"peport" 
//		Имя файла шаблона (excel), по которому формируется шапка
//		TEMPLATE:"C:\Templ.xls"
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.041> 	<28.08.2001 14:59>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема>:	 Сваливается когда в шапке объединяются ячейки 
//							при использовании шаблона
//	<Причина>:	Данные продолжали писаться в шапку 
//   <Решение>:  Не давать писать в шапку
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.042> 	<6.09.2001 15:09>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема>:	проблемы с заполнением шаблона - шаблон грузится без
//				шапки, столбцы открываются, строки нет
//	<Причина>:	опечатки 
//  <Решение>:  исправили
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.043> 	<18.09.2001 18:00>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Изменение>:	Договорились, что если флаг шапки = FALSE,
//				и имя шаблона не задано, то в качестве шаблона
//				используется основной Excel файл.
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.044> 	<2.10.2001 16:00>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Изменение>: Добавлена возможность раскрашивать столбцы отчета
//		при работе с шаблоном для этого достаточно раскрасить ячейку
//		в последней строке шапки нужным цветом и стилем.
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.045> 	<2.10.2001 16:00>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема>:	Табуляция интерпретировалась не правильно - каждый
//				символ табуляции заменялся на заранее определенное кол. пробелов
//  <Решение>:  Написал функцию, которая подбирает необходимое количество пробелов
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.046> 	<11.10.2001 13:55>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Изменения>: Внесена возможность форматировать строки текста 
//				 (цвет, фон, размер, стиль и т.д.) по специальным тэгам,
//	   			 которые описываются в файле конфигурации. 
//				 TEXTFORMAT - ключевое слово для описания тэгов форматирования
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.047> 	<25.10.2001 14:37>
//
//  <Логический модуль>: конвертация текстового отчета
//
//	<Проблема>: под Windows XP программа валилась 
//				в функции FillSafeArray на VariantClear
//	<Решение> : убрал эту функцию, так как она не особо нужна, но почему
//				валится так и не выяснил.
//
//  <Изменения 1>: Внесена возможность устанавливать нужный числовой формат столбца
//				   в шаблонном режиме по певой строке после шапки
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.048> 	<13.12.2001 15:07>
//
//  <Логический модуль>: конвертация с использованием 
//	буфферной базы в аналоговой адресации
//
//	<Проблема>: При объединении ячеек в аналоговой адрессации 
//				не правильно определяется адрес ячейки, т. к
//				адреса вычесляются по смещениюю
//
//	<Решение> : в таблице синонимов теперь хранятся не смещения, 
//				реальные адреса в виде [Cell1]_X .. A$5 
//	<Пример>:   m_ColMap[nameX1] :=  C$5
//				m_RowMap[nameY1] :=	 B$10
//				RealCell = C10 - значение реальной ячейки		
//
//  <Изменения 1>: Внесена возможность устанавливать нужный числовой формат столбца
//				   в шаблонном режиме по певой строке после шапки
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.049> <17.12.2001 11:41>
//
//  <Логический модуль>: конвертация с использованием 
//	буфферной базы в аналоговой адресации
//
//	<Проблема>: 1. Даты не правильно преобразуются ... строчка
//					воспринемается как формула:
//				   01\12\01 -> в число 
//              2. 01.12.01 -> 01,12,01 
//
//	<Решение> : 1. SetFormulaArray заменил на SetValue
//				2. (01.12.01 -> 01,12,01) Пока оставил как есть 
//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.050>		<25.12.2001  11:10>
//
//  <Логический модуль>: конвертация с использованием 
//						 буфферной базы в аналоговой адресации 
//
//  <Проблема>:	Конец таблицы определяется по первой пустой ячейке
//				- это не всегда удобно (в частности для форм из "консультанта")
//  <Решение>:  Конец таблицы определять по двум пустым ячейкам
// 					 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.051>		<15.01.2002  10:18>
//
//  <Логический модуль>: конвертация с использованием 
//						 буфферной базы
//
//  <Проблема>:	1. Не происходит переключения между разными 
//				   Excel файлами
//				2. При конвертации текстового отчета по шаблону
//				   по первой строчке надо сохранять не только
//				   формат ячейки, но и шрифт, и все что можно
//				3. После ззамены SetFormulaArray на SetValue
//				   все стало выгружаться в символьном виде
//				   заказчиков это не устраивает.
//				4. Заказчика не устраивает (Юкос), когда пред 
//					балансовым счетом ставится "|"
//
//  <Решение 1>:  Переключать
//  <Решение 2>:  Распространять шрифт верхней ячейки столбца
//					на весь столбец
//	<Решение 3>:  SetValue -> SetFormulaArray
//	<Решение 4>:  После распознавания дат и балансовых счетов перед
//				  ним ставится пробел - это позволяет обманывать Excel
//				  и выводить все в нужном виде	
// 					 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.052>		<4.02.2002  11:30>
//
//  <Логический модуль>: конвертация с использованием 
//						 буфферной базы
//
//  <Проблема 1>: Не переключаются листы
//	<Проблема 2>: Надо внести возможность скрывать строки 
//	<Проблема 3>: DYNHEADLINE не работает в шапке документа
//
//  <Решение 1>: Баг - не присваивал (oldList = nameList)  
//	<Решение 2>: Введено ключевое слово ROWHIDE: в файле конфигураций,
//				 в котором описан тэг, отвечающий за скрытие строки
//	   <Пример>: ROWHIDE: "clr"  ... в тексте отчета в нужной строке
//				 надо поставить тэг <clr> .... text .... <clr\> -
//				 - заключительный тэг <clr\> можно опустить
//
//	<Решение 3>: DYNHEADLINE работает теперь и в шапке документа
//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.053>		<25.03.2002  11:38>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема 1>: При работе с шаблоном программ переформатирут шапку, что не всегда
//				  правильно и удобно
//
//  <Решение 1>:  Ввел переменную которая считает разделительные линии
//				  в шапке и по ее значению определяю, откуда надо форматировать таблицу
//				  	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.054>		<27.03.2002  11:38>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема 1>: Ошибка при генерации закрывающего тэга скрытия строк
//	<Проблема 2>: Если тэг скрытия строк стоит в конце, то строка не
//				  всегда скрывается
//
//  <Решение 1>:  тэг закрытия стал: </tag> был <tag> 
//	<Решение 2>:  Обнаружилась недоработка в разборе тэгов - после разбора тэг скрытия не
//		входил в буфферный массив, поскольку он тоже разбирался по строке
//		форматирования.
//
//		@==== ==== ======== ===
//			[до разбора]
//	m1  <тэг>1      2      3    <cld>_!_  - строка с тэгами
//	m2   1      2       3   _!_            - строка без тэгов
//			[после разбора]
//		@==== ==== ======== ===   часть которая не разбирается
//	mm1 <тэг>|    | 2      |3  |  <cld>_!_
//	mm2 1    | 2  |      3 |_!_|
//    
//		Получается, что текст разбирется правильно, а тэг
//		учитыввается не всегда. Поэтому пока, чтобы все правильно
//		заработало, надо последнюю строку расширить, чтобы тэг скрытия
//		гарантировано попадал в буфферный массив разбора.
//		
//		Добавлена функция DivideFixTagPattern, которая производит пра
//		вильный разбор
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.0541>		<1.04.2002  11:38>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема>: При конвертации отчета без файла конфигурации
//				вываливается сообщение	Out of Memory
//
//  <Причина>:  При разборе в (1682) ReplaceTab(strLine, pcfg->iTab);
//				pcfg->iTab - оказалось очень большим числом, т. к.
//				при инициализации обекта CStructCFG - iTag не опред.,
//				а оперд только когда разбирался файл конфигурации
//	<Решение>:  В конструктор CStructCFG вставил инициализацию по 
//				умолчанию iTag = 8
//				  	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.055>		<25.04.2002  9:45>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема>: Необходимо удалять последовательности
//				x1b\x50, x1b\x53\x30, x1b\x54, x1b\x32, x1b\x41\x08
//
//	<Решение>:  Описал в ChangeTag [] новые заменяемые последова-
//				тельности.
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  <Ver 2.057>		<27.05.2002  9:57>
//
//  <Логический модуль>: конвертация текстового отчета
//
//  <Проблема>: Необходимо добавить возможность конвертировать отчет
//				сразу в несколько листов, имена которых будут перечислены
//				в файле конфигураций в тэге LISTNAME:
//
//	<Решение>:  
//				
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#if !defined( __AUTOPROJECT_H )
#define __AUTOPROJECT_H

#include "ictypes.h"	
#include "resource.h"		// main symbols

#define COLUMN_WIDTH_COEFF 1.2

char *convertNumber(char *str);
char *convertDate(char *str);
BOOL DelLPrintCod();
char *replaceTab(char *str, int iTab);
char *getWorkBookName(char *xlsName);
BOOL WaitRangeLock(void);

char *divideToCellBeg(char *str);
char *divideToCellEnd(char *str);

BOOL run(int argc, char *argv[]);

/////////////////////////////////////////////////////////////////////////////

#endif /* __AUTOPROJECT_H */
